const n=`---
slug: ant-group
title: 第一份工作回忆录
date: 2026-08-24 23:37:47
authors: yuluo
tags: [Blog]
keywords: [Blog]
---

<!-- truncate -->

## 1. 为什么写？

8 月份刚从人生中第一家公司离职跳槽，来到了一家初创公司，做 AI Infra。按照以往的习惯总是要写点什么，以此记录人生中的第一段旅程。

即是对之前工作生活的回顾也是总结，凡事发生必有利于我。今天才勘勘梳理出来大纲，每次写都很纠结。

## 2. 学到了什么？

作为第一家公司，学习到了很多也收获到了很多：

- 工作上突发情况的应对；
- 对于不合理的需求勇敢说不；
- 对于完不成的需求如何拒绝；
- 如何保持学习，遇到 bug 时怎么分析；
- 如何与人交往等等。

### 2.1 Never Say No

这里借左耳朵耗子叔的一句话，永远 “Never Say No”。和交付，用户，产品沟通的时候，永远不要着急否定和快速拒绝对方。

打个比方，产品同学给了一个很复杂的需求，换成是之前的情况，我第一反应是接下，肯定会说我可以，尽力去做。但是一旦接受对方的诉求。那就要保质保量完成。对于任务的复杂度，需要花费的时间等等这些都一无所知。

相对来说更好的做法是：不要着急拒绝对方，先调研。充分了解足够的上下文并对齐交付时间和交付需求。如果在有限的时间内完不成需求要及时将风险抛出去。即是保护自己也是对别人负责。不要将风险累积到最后一刻才爆发出来。这属于**工作失职**。

对于来自于 leader 的需求，说必须要 x 天完成。这时候要学会向上管理。同样不要着急拒绝。在有限的时间内，是有条件的完成：

- 我可以完成，但质量不能保证；
- 我可以完成，但需求太多了，得减减；
- 要不时间延长一些，我能按照我最大的能力做好这件事情。

做到控制反转，选项永远都是可以干的，但是是有条件的干。不是一味的埋头干。

### 2.2 妥善管理自己的时间

在工作的时候，每当需要专心的去处理一个 bug 或者推敲一段代码的逻辑，这时候就需要一个相对于比较安静的环境来完成这件事情，不能被外界打扰。面对钉钉上一个又一个消息的时候。很难做到。

所以我一般的做法是会静音并带上耳机，给傍边人一种我在开会中的假象，钉钉也打扰不到我。我处理完了或者我想休息的时候在去打开钉钉回复这些琐碎的事情。

### 2.3 团队管理

通过和别的同学聊天中得知，遇到一个好的团队 leader 其实是三七开的概率。遇上一个不好的 leader。那就真的是很难受了。这里想说说我从公司中学到的我的 leader 的管理经验。

1. 处理任何线上故障或者突发问题时，都需要了解足够的 context。避免因为事态紧急而作出错误的响应

    在一次线上故障时，交付同学找到了我，说是一个接口请求链路超时问题，我都准备改代码给交付现场一个洗的包了。我改好了打了流水线。这时候我想起来我应该给我的 leader 说一下，因为这是对已经 release 的版本作修改。应该知情。而后 leader 在了解情况之后，拉上了下游的同学，一起分析问题。最终确定不是我们的问题，不需要我们来改。

2. 对待下属有一种友好交流的心态，保护下属，不要持一种批判的否定态度

    我觉得我前公司的 leader，是非常好的。如果有可能的话我其实是不想离开的，hhh。

### 2.4 总结和不断学习

在工作中，难免遇到一些新的术语或者新的名字。可能在和其他同学聊天过程中，冷不丁冒出一个新的名词，一门新的技术。始终保持学习的心态，学会聆听而不是反驳。易说的那样：**永远保持学徒的心。**。

学会审思，别人说的不见的全是对的。始终保持自己独立的思考。清醒的认知，不要被冲昏头脑。

不断总结，我有个习惯是会将平常做的一些琐事整理起来记录到一个 md 里面去，就是常说的留痕。也是提醒自己什么事情做了，什么事情没做，那个事情的优先级更高。整个团队的优先级不代表自己做事的优先级。

### 2.5 如何学习和成长

1. 如何学习

    这是一个比较长期的话题，怎么在繁杂的工作中，积累和学习到属于自己的东西。也是一门学问。我平时会这样做：
    - 在一个需求分配给我的时候，我会去找同类的项目 Github 或者别人的 blogs 相关的设计经验也好，AI 也好。不过我还是倾向于 Github。Github 上的项目大多都是许多大佬在用乃至提过补丁的代码，经过了业务的考验。一定比我自己拍脑袋想出来的方案更好。
    - 在后续评审的时候，听别人的意见，记录下来或者当场分析出来提意见的考虑角度，每个人因为经验和所处角度的不同，对同一个问题会有不同的看法。要做的是辩证看待。
    - 参与别人评审的时候，听别人讲自己的设计，设计时的踩坑点等等。

2. 多和别人交流

    孟母三迁，近朱者赤近墨者黑。周围环境对自身的影响是非常大的。跟一个什么样的人的待在一起，最终都会潜移默化的受影响。不要闭门造车。以开放，学习的心态和别人接触。

### 2.6 如何分析和解决问题

遇到过好几个难修复的 bug，最终或自己钻研或求助大佬。都解决了。这里面最令我记忆犹新的两个是：

1. Seatunnel 中因不同机器的文件系统不同，而导致的 Jar 包加载顺序的问题。我们的环境是在 pod 容器中。间接证明了 docker 容器并不是完全的环境隔离，还是依赖于宿主机的环境。

2. Seatunnel 中使用自签证书的 Minio 做数据源时，TLS 验证失败的问题，这个问题说来也好解决。是缺少一个 hadoop 的连接配置。但是当时实在不想研究了，直接摇人。（不可否认，摇人永远是解决问题的有效方式，没有之一，但是要在自己尝试之后在去。

当然还有其他别的 PR，但是这两个是我印象比较深的 bug。总结下就是说，在遇到 bug 时仔细分析异常栈信息，分析 bug 出现场景和关联关系。不要急于尝试。能一眼看出问题也是依赖个人积累的。然后是平时的日常积累，基础知识的积累在排查问题的时候显得尤为重要。比如网络问题的排查，如果出现 CLOSE_WAIT 是被动关闭，一定是自己的业务代码问题，TIME_WAIT 是主动关闭，正常情况。

另外就是 linux 工具的使用，例如 cat，grep，tail -f，less，head 等等。在繁杂的日志中快速定位自己需要的内容。

## 3. 总结 & 反思

上面写了这么多，还是总结下。1 年 8 个月的工作经历还是学到了很多。

### 3.1 个人总结

大致有下面这几个方面。一是工作留痕，不是为了某个时期推卸责任，而是为了提醒自己，什么事做了，什么事没做，当初为什么这么做？二是花了时间排查的问题都记录下来，这次的记录是为了下次遇到时更加从容应对。三是不断学习，程序员这个行业就是如此，每月每天都有新的名词，产品和技术出现。尤其在 AI 出现之后，AI 技术的迭代几乎是以周为单位。上一周还流行的东西下一周就可能被 XXX 取代。

### 3.2 反思

在这一年中也大概摸清楚了自己的定位和长远的目标。我始终觉得业务代码没有太多的挑战性。无非就是 CRUD 和一些特殊，比较复杂的逻辑判断组合在一起。（虽然在面试的时候被面试官说过，业务经验不足，但我觉得那是架构设计的问题，我没太多的机会设计架构而已，如果让我去做，我一样有信心能做好。

我始终想做的事情，应该是偏低层一些，毕业那会，k8s 云原生，AI 盛行。本来想的是找一份 k8s 相关的工作，阴差阳错去做了密算相关的业务。但是现在还好，新入职的公司是一个不错的方向，希望在这里能有不一样的工作经历。

这时候就有了另外一个问题，在工作内容和钱之间。选择什么？因为家庭出身的原因，我本身是一半一半的，甚至说钱的影响因素会占到 60%。总要有所追求，在和今年参加校招的同学一起聊过这个话题。普遍都持有一种悲观的态度，现在有了 AI，在牛逼的技术都不值一提，把钱拿到，牢牢攥紧才是当下最需要重视的事情。

但是在我的工作中，我发现一个事情：随着 AI 模型差距越来越小，大家写出来的代码应该都逐渐趋近于同一个水平线，但是实际情况恰恰相反。差别还是蛮大的。

最后，就是始终对新技术保持学习和求知的心。拥抱并探索新技术。和 Github 上的签名一样，希望做点有意义的事情，在开源上留下我的痕迹。

## 4. Next

遥想当初，非常感谢在蚂蚁和数马大家对我的照顾，不管是同事也好，leader 也好，一起完成的需求，一起熬过的夜都历历在目。

月帆，楚铮，或存，临川，涵冰，焉思，树晓，淞泉，凤矽。

月榭，崇高，余迪，雨土，北魏，冠熙，陆枫，上时，毅昂，思远，佳琪，节宁。

（花名不分先后。

到现在，已经离职 8 天了，进入了新的环境，开始了下一份工作。希望在这里中有更多的收获和成长。

![办公楼前](/img/summary/antgroup.jpg)
`;export{n as default};
